package com.bn.util;

/**
 * Created by Administrator on 2017/6/9.
 */

public class Constant {
    //男
    public static float manHeight=493.079f;//男的高度
    public static int manOrganNumber=14;//男的器官个数
    //女
    public static int WomanOrganNumber=14;//男的器官个数
    //光带
    public static float linePosition=60.0f;//线的位置
    public static float lineWidth=15f;//线的宽度
    public static float lineBright=0.6f;//线的亮度
    //呼吸
    public static float manMaxLight=1.4f;//最高呼吸系数
    //器官颜色
    public static float organColor[][]={  //男器官颜色
            {199/255.0f,190/255.0f,181/255.0f,1.0f},//骨骼颜色
            {217/255.0f,157/255.0f,156/255.0f,1.0f}, //大脑颜色
            {150/255.0f,80/255.0f,80/255.0f,1.0f},   //食道颜色
            {174/255.0f,128/255.0f,138/255.0f,1.0f},   //肺
            {135/255.0f,71/255.0f,69/255.0f,1.0f},  //心脏
            {87/255.0f,49/255.0f,36/255.0f,1.0f},  //肝
            {185/255.0f,179/255.0f,145/255.0f,1.0f},  //胰脏
            {70/255.0f,100/255.0f,46/255.0f,1.0f},  //胆囊
            {240/255.0f,180/255.0f,182/255.0f,1.0f},//胃
            {142/255.0f,89/255.0f,105/255.0f,1.0f},//脾
            {231/255.0f,202/255.0f,162/255.0f,1.0f},//肠
            {136/255.0f,61/255.0f,40/255.0f,1.0f},//肾
            {204/255.0f,119/255.0f,98/255.0f,1.0f},//膀胱
            {174/255.0f,128/255.0f,138/255.0f,1.0f}//未知
    };
    public static float womanorganColor[][]={  //女器官颜色  15
            {199/255.0f,190/255.0f,181/255.0f,1.0f},//骨骼颜色
            {217/255.0f,157/255.0f,156/255.0f,1.0f}, //大脑颜色
            {150/255.0f,80/255.0f,80/255.0f,1.0f},   //食道颜色
            {174/255.0f,128/255.0f,138/255.0f,1.0f},   //肺
            {135/255.0f,71/255.0f,69/255.0f,1.0f},  //心脏
            {87/255.0f,49/255.0f,36/255.0f,1.0f},  //肝
            {185/255.0f,179/255.0f,145/255.0f,1.0f},  //胰脏
            {70/255.0f,100/255.0f,46/255.0f,1.0f},  //胆囊
            {240/255.0f,180/255.0f,182/255.0f,1.0f},//胃
            {185/255.0f,109/255.0f,135/255.0f,1.0f},//子宫
            {231/255.0f,202/255.0f,162/255.0f,1.0f},//肠
            {136/255.0f,61/255.0f,40/255.0f,1.0f},//肾
            {204/255.0f,119/255.0f,98/255.0f,1.0f},//膀胱
            {174/255.0f,128/255.0f,138/255.0f,1.0f}//未知
    };
}
